uat_chat/Documents/уатБилетныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>уатБилетныйЛист</Name>
			<Comment>(уат)</Comment>
			<BasedOn>
				<xr:Item>Document.уатПутевойЛист</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатБилетыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.уатВыручка</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПринятоВКассу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПроданоБилетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Билеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутевойЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Билет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатБилеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерНачальный</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКонечный</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

uat_chat/InformationRegisters/уатСведенияОСотрудниках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>уатСведенияОСотрудниках</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>идДОк</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.уатОсновныеНачисления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Позывной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/AccumulationRegisters/уатБилетыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>уатБилетыНаСкладах</Name>
			<Comment>(уат)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Билет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатБилеты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатБилетныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПоступлениеБилетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

uat_chat/AccumulationRegisters/уатВыручка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>уатВыручка</Name>
			<Comment>(уат)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомиссияАвтостанции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПутевойЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автостанция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Билет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатБилеты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

uat_chat/Documents/уатБилетныйЛист/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт; // Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения.
Перем ДанныеИзменились Экспорт; // Признак изменения данных документа (экспорт сделан для использования формой объекта).
Перем ТаблицаПоБилетам;


////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

Процедура ПроверитьЗаполнениеДокумента(СтруктураШапкиДокумента,Отказ, Заголовок)
	
	СтруктураПолей = Новый Структура("Организация, Склад, ТС, Сотрудник");
	уатОбщегоНазначенияТиповые.уатПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект,СтруктураПолей, Отказ, Заголовок);
	Если Отказ Тогда Возврат КонецЕсли;
	
	//СтруктураПолей = Новый Структура("Сотрудник, Количество, Сумма");
	СтруктураПолей = Новый Структура("Маршрут, Билет");
	уатОбщегоНазначенияТиповые.уатПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Билеты", СтруктураПолей, Отказ, Заголовок);
	
КонецПроцедуры

Функция ПолучитьМаршрут()
	Маршрут = Новый Структура("Номер, Наименование");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	уатБилетныйЛистБилеты.Маршрут.НомерМаршрута КАК Номер,
	|	уатБилетныйЛистБилеты.Маршрут.Наименование КАК Наименование
	|ИЗ
	|	Документ.уатБилетныйЛист.Билеты КАК уатБилетныйЛистБилеты
	|ГДЕ
	|	уатБилетныйЛистБилеты.Ссылка = &СсылкаНаОбъект";
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если  Выборка.Следующий() Тогда 
		Маршрут.Номер = Выборка.Номер;
		Маршрут.Наименование = Выборка.Наименование;
	КонецЕсли;
	Возврат Маршрут;
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуБилетов()
	
	ТаблицаПоБилетам = Билеты.Выгрузить();
	
	Возврат ТаблицаПоБилетам;
	
КонецФункции // ПодготовитьТаблицуМатериалов()

#Если Клиент Тогда
		
	// Возвращает доступные варианты печати документа
	//
	// Возвращаемое значение:
	//  Структура, каждая строка которой соответствует одному из вариантов печати
	//  
	//Функция ПолучитьСписокПечатныхФорм() Экспорт
	Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
		
		СтруктураМакетов = Новый Структура;
		СтруктураМакетов.Вставить("ПечататьВесьБилетныйЛист", "Печатать весь билетный лист");
		СтруктураМакетов.Вставить("ПечататьЛицСторону", "Печатать лиц. сторону");
		СтруктураМакетов.Вставить("ПечататьОбрСторону", "Печатать обр. сторону");
		
		Возврат СтруктураМакетов ;
		
	КонецФункции // ПолучитьСтруктуруПечатныхФорм()
	
	// Функция выполняет печать документа билетный лист
	// Параметры:
	//  нет
	// 
	// Возвращаемое значение:
	//  табличныйДокумент - печатная форма
	//
	Функция ПечатьБЛ(ФлагПечати="") Экспорт
		ТабДокумент = Новый ТабличныйДокумент;
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	уатБилетныйЛист.Номер КАК НомерДокумента,
		|	уатБилетныйЛист.Дата КАК ДатаДокумента,
		|	уатБилетныйЛист.Организация,
		|	уатБилетныйЛист.Сотрудник КАК Кондуктор,
		|	уатБилетныйЛист.ТС.ГосударственныйНомер КАК ГосНомерТС,
		|	уатСведенияОСотрудникахСрезПоследних.ТабельныйНомер КАК ТабельныйНомер
		|ИЗ
		|	Документ.уатБилетныйЛист КАК уатБилетныйЛист
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатСведенияОСотрудниках.СрезПоследних КАК уатСведенияОСотрудникахСрезПоследних
		|		ПО уатБилетныйЛист.Сотрудник = уатСведенияОСотрудникахСрезПоследних.Сотрудник
		|			И уатБилетныйЛист.Организация = уатСведенияОСотрудникахСрезПоследних.Организация
		|ГДЕ
		|	уатБилетныйЛист.Ссылка = &СсылкаНаОбъект";
		
		Запрос.УстановитьПараметр("СсылкаНаОбъект", Ссылка);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			ДанныеШапка = Выборка;
		Иначе
			Сообщить("Не удалось напечатать документ", СтатусСообщения.Важное);
		КонецЕсли;
		
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 9
		|	уатБилетныйЛистБилеты.Билет.ВидБилета КАК ВидБилета,
		|	уатБилетныйЛистБилеты.Билет.Цена КАК ЦенаБилета,
		|	уатБилетныйЛистБилеты.Билет.Серия КАК СерияБилета,
		|	уатБилетныйЛистБилеты.НомерНачальный КАК НомерБилетаНачальный,
		|	уатБилетныйЛистБилеты.НомерКонечный КАК НомерБилетаКонечный,
		|	уатБилетныйЛистБилеты.Количество КАК КоличествоБилетов,
		|	уатБилетныйЛистБилеты.Сумма КАК СуммаБилетов
		|ИЗ
		|	Документ.уатБилетныйЛист.Билеты КАК уатБилетныйЛистБилеты
		|ГДЕ
		|	уатБилетныйЛистБилеты.Ссылка = &СсылкаНаОбъект
		|
		|УПОРЯДОЧИТЬ ПО
		|	уатБилетныйЛистБилеты.НомерСтроки";
		
		ВыборкаСтрок = Запрос.Выполнить().Выбрать();
		Макет = ПолучитьМакет("БилетноУчетныйЛист");
		
		//печатаем лицевую сторону п/л
		Если ФлагПечати <> 2 Тогда
			Область = Макет.ПолучитьОбласть("Страница1");
			Область.Параметры.Заполнить(ДанныеШапка);
			Область.Параметры.НомерДокумента = Формат(Число(уатОбщегоНазначенияТиповые.уатПолучитьНомерНаПечать(Ссылка)), "ЧЦ=6; ЧВН=; ЧГ=0");
			Маршрут = ПолучитьМаршрут();
			Область.Параметры.НомерМаршрута = Маршрут.Номер;
			Область.Параметры.НаименованиеМаршрута = Маршрут.Наименование;
			Счетчик = 1;
			Пока ВыборкаСтрок.Следующий() Цикл
				Область.Параметры["ВидБилета"            + Строка(Счетчик)] = ВыборкаСтрок.ВидБилета;
				Область.Параметры["ЦенаБилета"           + Строка(Счетчик)] = ВыборкаСтрок.ЦенаБилета;
				Область.Параметры["СерияБилета"          + Строка(Счетчик)] = ВыборкаСтрок.СерияБилета;
				Область.Параметры["НомерБилетаНачальный" + Строка(Счетчик)] = ВыборкаСтрок.НомерБилетаНачальный;
				Область.Параметры["НомерБилетаКонечный"  + Строка(Счетчик)] = ВыборкаСтрок.НомерБилетаКонечный;
				Область.Параметры["КоличествоБилетов"    + Строка(Счетчик)] = ВыборкаСтрок.КоличествоБилетов;
				Область.Параметры["СуммаБилетов"         + Строка(Счетчик)] = ВыборкаСтрок.СуммаБилетов;
				Счетчик = Счетчик + 1;
			КонецЦикла;
			ТабДокумент.Вывести(Область);
		КонецЕсли;
		
		Если ФлагПечати = 0 Тогда	//Новая страница для печати полного пут. листа
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		//печатаем обратную сторону п/л
		Если ФлагПечати <> 1 Тогда
			
			Макет = ПолучитьМакет("БилетноУчетныйЛистОбратнаяСторона");
			Область = Макет.ПолучитьОбласть("Страница2");
			Область.Параметры.Заполнить(ДанныеШапка);
			ТабДокумент.Вывести(Область);
		КонецЕсли;
		Возврат ТабДокумент;
	КонецФункции
	
	// Процедура осуществляет печать документа. Можно направить печать на 
	// экран или принтер, а также распечатать необходимое количество копий.
	//
	//  Название макета печати передается в качестве параметра,
	// по переданному названию находим имя макета в соответствии.
	//
	// Параметры:
	//  НазваниеМакета - строка, название макета.
	//  ФлагПечати: 0 - весь п/л, 1 - лиц. сторона, 2 - обр. сторона
	//
	Процедура Печать(НазваниеМакета = "", КоличествоЭкземпляров = 1, НаПринтер = Ложь, ФлагПечати = 0) Экспорт
		
		Если ЭтоНовый() Тогда
			Предупреждение("Документ можно распечатать только после его записи");
			Возврат;
		ИначеЕсли Не ?(Права = Неопределено, Ложь, уатПраваИНастройки.уатПраво("ПечатьНепроведенных", Права)) Тогда
			Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
			Возврат;
		КонецЕсли;

		Если ДанныеИзменились И Не уатОбщегоНазначенияТиповые.ПроверитьМодифицированность(ЭтотОбъект)  Тогда
			Возврат;
		КонецЕсли;
		
		Если ТипЗнч(НазваниеМакета) = Тип("СправочникСсылка.ВнешниеОбработки") Тогда
			ИмяФайла = КаталогВременныхФайлов() + "PrnForm.tmp";
			ОбъектВнешнейФормы = НазваниеМакета.ПолучитьОбъект();
			Если ОбъектВнешнейФормы = Неопределено Тогда
				Сообщить("Ошибка получения внешней формы документа. Возможно форма была удалена", СтатусСообщения.Важное);
				Возврат;
			КонецЕсли;
			
			ДвоичныеДанные = ОбъектВнешнейФормы.ХранилищеВнешнейОбработки.Получить();
			ДвоичныеДанные.Записать(ИмяФайла);
			Обработка = ВнешниеОбработки.Создать(ИмяФайла);
			Попытка
				Обработка.СсылкаНаОбъект = Ссылка;
				ТабДокумент = Обработка.Печать();
				уатОбщегоНазначенияТиповые.уатНапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, уатОбщегоНазначенияТиповые.уатСформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()), Права);
			Исключение
				Сообщить("Ошибка формата внешней обработки. Возможно выбрана обработка не для печати.", СтатусСообщения.Важное);
			КонецПопытки;
		Иначе
			Если НазваниеМакета = "ПечататьЛицСторону" Тогда
				ТабДокумент = ПечатьБЛ(1);
				уатОбщегоНазначенияТиповые.уатНапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, уатОбщегоНазначенияТиповые.уатСформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()), Права);
			ИначеЕсли   НазваниеМакета = "ПечататьОбрСторону" Тогда
				ТабДокумент = ПечатьБЛ(2);
				уатОбщегоНазначенияТиповые.уатНапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, уатОбщегоНазначенияТиповые.уатСформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()), Права);
			ИначеЕсли   НазваниеМакета = "ПечататьВесьБилетныйЛист" Тогда
				ТабДокумент = ПечатьБЛ();
				уатОбщегоНазначенияТиповые.уатНапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, уатОбщегоНазначенияТиповые.уатСформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()), Права );
			КонецЕсли;
		КонецЕсли;    		
	КонецПроцедуры // Печать
	
#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Процедура движений по регистру агрегатов
//
Процедура ФормированиеДвиженийПоСкладу(Отказ, Заголовок, РежимПроведения)
	
	ТаблицаПоБилетам		= ПодготовитьТаблицуБилетов();
	
	// Выполняем списание со склада, заполняем таблицу материалов рассчитанной стоимостью списания проводим по ТС
	
	НаборЗаписейПоБилетам								= Движения.уатБилетыНаСкладах;
	НаборЗаписейПоБилетам.ДокументОбъект				= ЭтотОбъект;
	НаборЗаписейПоБилетам.РезультатЗапросаПоБилетам		= ТаблицаПоБилетам;
	Отказ												= НЕ НаборЗаписейПоБилетам.Расход() ИЛИ Отказ;
	
КонецПроцедуры // ФормированиеДвиженийПоАгрегатам()

// Функция списания материалов с регистра ТоварыНаСкладе
//
Функция ФормированиеДвиженийПоВыручке(Отказ, Заголовок, РежимПроведения)
	
	НаборДвижений   = Движения.уатВыручка;
	ТаблицаДвижений = НаборДвижений.Выгрузить();
	
	Для Каждого ТекСтрока Из Билеты Цикл
		НоваяСтрока 			= ТаблицаДвижений.Добавить();
		НоваяСтрока.Период 		= Дата;
		НоваяСтрока.Сотрудник 	= Сотрудник;
		НоваяСтрока.Организация = Организация;
		НоваяСтрока.ПутевойЛист = ТекСтрока.ПутевойЛист;
		НоваяСтрока.ТС 			= ТС;
		НоваяСтрока.Маршрут 	= ТекСтрока.Маршрут;
		НоваяСтрока.Билет 		= ТекСтрока.Билет;
		НоваяСтрока.Количество 	= ТекСтрока.Количество;
		НоваяСтрока.Сумма 		= ТекСтрока.Сумма; 
	КонецЦикла;
	
	НаборДвижений.Загрузить(ТаблицаДвижений);
	НаборДвижений.УстановитьАктивность(Истина);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание) = Тип("Форма") Или ТипЗнч(Основание) = Тип("ДокументСсылка.уатПутевойЛист") Тогда
		Организация = Основание.Организация;
		Ответственный = Основание.Ответственный;
		ТС = Основание.ТранспортноеСредство;
		Сотрудник = Основание.Водитель1;
		
		Если Не ЗначениеЗаполнено(Дата) Тогда
			Дата = Основание.ДатаВыезда;
		КонецЕсли;
		
		//добавим основной ТС
		НоваяСтрока = Билеты.Добавить();
		НоваяСтрока.ПутевойЛист = Основание.Ссылка;
		
		Если Основание.Задание.Количество() > 0 Тогда
			ТекСтрока = Основание.Задание[0];
			НоваяСтрока.Маршрут = ТекСтрока.Маршрут;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(Ссылка);
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	ПроверитьЗаполнениеДокумента(СтруктураШапкиДокумента,Отказ, Заголовок);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ФормированиеДвиженийПоВыручке(Отказ, "", РежимПроведения);
	ФормированиеДвиженийПоСкладу(Отказ, "", РежимПроведения);
	
КонецПроцедуры

// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	уатОбщегоНазначения.уатПроверкаПравПередЗаписьюВДокументах(ЭтотОбъект, Отказ, , Права);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	СуммаДокумента = Билеты.Итог("Сумма");
	СуммаПроданоБилетов = СуммаДокумента;
	
КонецПроцедуры // ПередЗаписью


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// инициализируем переменную
ДанныеИзменились = Ложь;

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
	Права = глПраваУАТ;	
#КонецЕсли
